using Tyuiu.skirnevskyBR.Sprint1.Task3.V5.Lib;
DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнил: Скирневский Б.Р. | ИБКСб-25-1";
Console.WriteLine("*****************************************************");
Console.WriteLine("* Спринт #1                                         *");
Console.WriteLine("* Тема: Базовые навыки в С#                         *");
Console.WriteLine("* Задание #3                                        *");
Console.WriteLine("* Вариант #5                                        *");
Console.WriteLine("* Выполнил: Скирневский Богдан                      *");
Console.WriteLine("* Романович | ИБКСб-25-1                            *");
Console.WriteLine("*****************************************************");
Console.WriteLine("* УСЛОВИЕ:  Написать программу вычисления           *");
Console.WriteLine("* расстояния между населенными пунктами,            *");
Console.WriteLine("* изображенными на карте. Ответ округлите до 3      *");
Console.WriteLine("*  знаков после запятой.                            *");
Console.WriteLine("*****************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                  *");
Console.WriteLine("*****************************************************");
double x = 120;
double y = 3.5;
Console.WriteLine("Маштаб карты 120 км                                 *");
Console.WriteLine("Расстояние между точками, изображающими             *");
Console.WriteLine("населенные пункты 3.5 см                            *");
Console.WriteLine("*****************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                        *");
Console.WriteLine("*****************************************************");
Console.WriteLine("Расстояние между городами равно " +  ds.DistanceLength(x, y));
Console.ReadLine();
